module.exports = {
  clickDismiss: 'Жабу үшін басыңыз',

  title: 'radio.txt құрушы',
  intro: 'radio.txt файлын Hiby ойнатқыштарында қолдану үшін жасауға арналған сайт',
  hibyLink: 'Hiby цифрлық аудио ойнатқыштары',
  siteUse: 'Сайтты қолдану үшін',
  step1: 'Станцияларды атау немесе жанр бойынша сүзгілеңіз (мысалы, somafm, hip hop, jazz), содан кейін radio.txt файлына қосқыңыз келетін станцияларды таңдаңыз.',
  step2: 'Тізім дайын болғанда, "Жүктеу" түймесін басып, мәтін файлын Hiby құрылғыңыздың сақтау орнының түбірлік қалтасына сақтаңыз.',
  closeButtonText: 'жабу',

  filterLabel: 'Атау немесе жанр бойынша сүзгілеу',
  downloadButtonText: 'жүктеу',
  volume: 'Дыбыс деңгейі',

  thanks: 'Егер бұл сайт сізге пайдалы болса және оның жұмысын қолдағыңыз келсе, үлес қоса аласыз. Сіздің қолдауыңыз хостинг пен дамуды жалғастыруға көмектеседі. Рақмет!',
  securityContact: 'Қауіпсіздік бойынша байланыс',

  addStation: 'станция қосу',
  addCase1: 'URL "audio/mpeg" немесе "audio/mp3" мазмұн түріндегі Icecast сервері болуы тиіс',
  addCase2: 'API басқа ақпаратты ағын тақырыптарынан алады.',
  stationURL: 'Станцияның URL мекенжайы',
  addButtonText: 'қосу',

  stations: 'станциялар',

  stationExists: 'Станция бұрыннан бар',
  conTestFailed: error => `Байланысты тексеру сәтсіз аяқталды: ${error}`,
  noName: 'Станция атауын алу мүмкін болмады',
  stationSaved: id => `Станция сақталды, ID: ${id}`,
  addFail: error => `Станцияны қосу сәтсіз аяқталды: ${error}`,

  dupLogged: 'Қайталанушы тіркелді',
  dupLogFail: error => `Қайталану қатесін тіркеу сәтсіз: ${error}`,

  cspError: error => `CSP есептемесін сақтау қатесі: ${error}`,

  stationsFail: error => `Станцияларды алу қатесі: ${error}`,

  errorLog: 'қате тіркелді',
  errorLogFail: error => `Қате тіркеу сәтсіз аяқталды: ${error}`,

  genresFail: error => `Жанрларды алу қатесі: ${error}`
};
