module.exports = {
  clickDismiss: 'Нажмите, чтобы закрыть',

  title: 'Создатель radio.txt',
  intro: 'Сайт для создания собственного radio.txt для использования с ',
  hibyLink: 'цифровыми аудиоплеерами Hiby',
  siteUse: 'Чтобы использовать сайт',
  step1: 'Отфильтруйте станции по названию или жанру (например, somafm, hip hop, jazz), затем добавьте все станции, которые вы хотите включить в файл radio.txt.',
  step2: 'Когда вы будете довольны списком, нажмите "Скачать" и сохраните текстовый файл в корневой каталог хранилища вашего плеера Hiby.',
  closeButtonText: 'закрыть',

  filterLabel: 'Фильтр по названию или жанру',
  downloadButtonText: 'скачать',
  volume: 'Громкость',

  thanks: 'Спасибо за использование сайта. Пожалуйста, сообщайте о любых проблемах с безопасностью по контактной информации ниже.',
  securityContact: 'Контакт по вопросам безопасности',

  addStation: 'добавить станцию',
  addCase1: 'URL должен вести на сервер Icecast с типом контента "audio/mpeg" или "audio/mp3"',
  addCase2: 'API получит остальную информацию из заголовков потока.',
  stationURL: 'URL станции',
  addButtonText: 'добавить',

  stations: 'станции'
};
