export const kk = {
  stations: (count) => `${count} радиостанция`,
  genreError: 'Жарамсыз енгізу. Өтінеміз, дұрыс жанрды енгізіңіз.',
  stationsError: error => `Станциялар жүктелгенде қате шықты: ${error}`,

  playing: name => `Ойнатылып жатыр: ${name}`,
  homepage: 'басты бет',
  homepageTitle: homepage => `${homepage} бетіне өту`, 
  markDup: 'қайталануды белгілеу',
  dupTitle: 'станцияны қайталанушы ретінде белгілеу',
  playingError: error => `Медиа ойнатуда қате пайда болды: ${error}`,
  noHome: 'Басты бет жоқ',
  errorHome: error => `Басты бет ашылмады: ${error}`,
  invalidStation: `Станция деректері жарамсыз. Ағын ойнатылмайды.`,
  offline: 'Желі ажыратылды: қайта қосылу әрекеті',
  online: 'Қайта қосылды: ойнату қайта басталуда',

  playTitle: 'Ағынды ойнату',
  addTitle: 'Файлға қосу', 
  removeTitle: 'Файлдан жою',

  appUpdated: 'Қосымша жаңартылды',
  pressToRefresh: 'Жаңарту үшін басыңыз',

  dismiss: 'Жабу үшін басыңыз',
  moving: (newURL, currentURL) => `
    <h2>Біз көшіп жатырмыз — Назар аударыңыз!</h2>
    <p>Келесі айдан бастап, сайтымыз жаңа тұрақты мекенжайда жұмыс істейді:</p>
    <p style="font-weight: bold; font-size: 1.1em;"><a href="${newURL}" target="_blank" rel="noopener noreferrer">${newURL}</a></p>
    <p>Осы айдың соңына дейін <strong>${currentURL}</strong> арқылы сайтқа кіруге болады, бірақ 1-нен кейін барлық кірулер автоматты түрде жаңа мекенжайға бағытталады.</p>
    <p>Кедергілерді болдырмау үшін бетбелгілеріңізді жаңартуыңызды ұсынамыз.</p>
    <p>Біз осы өзгеріске қуаныштымыз және бізбен бірге болғаныңыз үшін алғыс айтамыз!</p>
  `
};
